name: "ensemble_model"
platform: "ensemble"
# max_batch_size: 1

input [
    {
    name: "input_tensor"
    data_type: TYPE_UINT8
    dims: [1, -1, -1, 3]
    }
  ]

output [
    {
    name: "bounding_boxes"
    data_type: TYPE_FP32
    dims: [-1, 4]
    },
    {
    name: "classes_names"
    data_type: TYPE_STRING
    dims: [1, -1]
    }
]

ensemble_scheduling {
  step [
    {
      model_name: "cell_counting"
      model_version: -1
      input_map {
        key: "input_tensor"
        value: "input_tensor"
      },
      output_map {
        key: "raw_detection_boxes"
        value: "raw_detection_boxes_result"
      },
      output_map {
        key: "raw_detection_scores"
        value: "raw_detection_scores_result"
      }
      output_map {
        key: "num_detections"
        value: "num_detections_result"
      },
      output_map {
        key: "detection_classes"
        value: "detection_classes_result"
      },
      output_map {
        key: "detection_boxes"
        value: "detection_boxes_result"
      },
      output_map {
        key: "detection_multiclass_scores"
        value: "detection_multiclass_scores_result"
      },
      output_map {
        key: "detection_scores"
        value: "detection_scores_result"
      }
      output_map {
        key: "detection_anchor_indices"
        value: "detection_anchor_indices_result"
      }
    },
    {
      model_name: "triton_post_process"
      model_version: -1
      input_map {
        key: "input_tensor"
        value: "input_tensor"
      },
      input_map {
        key: "raw_detection_boxes"
        value: "raw_detection_boxes_result"
      },
      input_map {
        key: "raw_detection_scores"
        value: "raw_detection_scores_result"
      }
      input_map {
        key: "num_detections"
        value: "num_detections_result"
      },
      input_map {
        key: "detection_classes"
        value: "detection_classes_result"
      },
      input_map {
        key: "detection_multiclass_scores"
        value: "detection_multiclass_scores_result"
      },
      input_map {
        key: "detection_boxes"
        value: "detection_boxes_result"
      },
      input_map {
        key: "detection_scores"
        value: "detection_scores_result"
      }
      input_map {
        key: "detection_anchor_indices"
        value: "detection_anchor_indices_result"
      }
      output_map {
        key: "bounding_boxes"
        value: "bounding_boxes"
      }
      output_map {
        key: "classes_names"
        value: "classes_names"
      }
    }
  ]
}

